[
  {
    "title": "Director of Design",
    "company": "Liferay",
    "location": "Remote",
    "duration": "2022 — 2024",
    "description": "Leading a business unit of 40+ designers, working with the executive team to set strategic goals, and supporting leaders in Communication Design, Product Design, and Design Operations.",
    "responsibilities": [
      "Leading a business unit of 40+ designers",
      "Working with the executive team to set strategic goals",
      "Supporting leaders in Communication Design, Product Design, and Design Operations"
    ]
  },
  {
    "title": "Principal Designer",
    "company": "Liferay",
    "location": "Remote",
    "duration": "2021 — 2022",
    "description": "As Principal Designer, I continued to manage Product Design teams, while establishing and leading our Design Ops function.\n\nOne of my key contributions was setting the vision for a new version our Design System, rethinking how a design system can add value beyond a product organization and becoming a key value prop for enterprise customers.",
    "responsibilities": [
      "Managing Product Design teams",
      "Establishing and leading Design Ops function",
      "Setting vision for a new version of Design System"
    ],
    "key_contributions": [
      "Rethinking how a design system can add value beyond a product organization",
      "Becoming a key value prop for enterprise customers"
    ]
  },
  {
    "title": "Senior Product Design Manager",
    "company": "Liferay",
    "location": "Diamond Bar, CA / Remote",
    "duration": "2019 — 2021",
    "description": "After working with Liferay’s first Director of Design to establish design as a standalone business unit, I began managing internationally and helped grow and lead other managers.",
    "responsibilities": [
      "Managing internationally",
      "Growing and leading other managers"
    ]
  },
  {
    "title": "UX Design Manager",
    "company": "Liferay",
    "location": "Diamond Bar, CA",
    "duration": "2017 — 2019",
    "description": "After spending 3 years gaining a deep understanding of our product and customers in my role as Web Designer, I moved to a product team tasked with developing an MVP for an entirely new product line. I also grew the UX team based in our LA office from 4 to 8.",
    "responsibilities": [
      "Developing MVP for an entirely new product line",
      "Growing the UX team from 4 to 8"
    ]
  },
  {
    "title": "Web Designer",
    "company": "Liferay",
    "location": "Diamond Bar, CA",
    "duration": "2014 — 2017",
    "description": "Liferay’s first web designer, I was hired to design and build pages to support our marketing efforts. I quickly took responsibility for all of our web properties and built a small team with 2 other designers.",
    "responsibilities": [
      "Designing and building pages to support marketing efforts",
      "Taking responsibility for all web properties",
      "Building a small team with 2 other designers"
    ]
  }
]
